#include <iostream>

int main()
{

	//1.절차지향언어의 반대 언어는? 
	//답:

	//2.실행파일이 만들어지는 과정을 써보세요:
	//답:

	//3.컴파일이 하는일을 적어보세요
	//답:

	//4.이 함수는 프로그램실행시 무조건 하나는 존재 해야되는데 특이한 함수여서 이름이 붙여져있는데 어떤함수 인가요?
	//답:

	//5.Hellow Word를 출력해보세요

	//6.정수 int를 하나 받아서 1500를 출력해보세요

	//7.4Byte 실수를 하나 받아서 3.14를 출력해보세요

	//8.char를 사용해서 문자 0을 출력해보세요

	//9.char를 사용해서 문자 Q를 출력해보세요

	//10.컴퓨터의 최소단위는 ?
	//답:

	//11.1Byte는 총 몇 Bit인가요?
	//답:

	//12.Bool자료형에서 bool bTest = 25; 정의를 하였다
	//bTest를 출력하게되면 1이나온다 이유를 말해보세요
	//답:


	//13.Short자료형 변수를 사용했을때 32768을 저장했을때 값이 -32768이 나온다 이유를 말해보세요
	//답:

	//14.
	unsigned char c1 = 255;
	char c2 = 255;

	//둘의 비트값은 동일하게 11111111로 나온다 
	//하지만 중단점을 걸어서 확인하면 값은 다르게 나온다 이유를 말해보세요
	//답:

	//15.2의보수법을 이용하여 3에대응되는 음수-3비트값을 구해보세요
	//0000 0011  =>3     
	//
	//답:


	return 0;
}