#include <iostream>

/*
1)
이중 for문을 활용해서 아래 모양들을 출력한다.
1-1.
*
**
***
****
*****

1-2.
*****
****
***
**
*

1-3.
    *
   **
  ***
 ****
*****

1-4.
*****
 ****
  ***
   **
    *

1-5.
   *
  ***
 *****
*******

1-6.
   *
  ***
 *****
*******
 *****
  ***
   *
*/


//2).while,비트연산자 등에 연산자를 이용해서 간단한 게임만들기  
// while과 비트연산자꼭 써야됨
//1.시작과 종료 버튼을 만든다
//2.시작을 누르게되면 게임이 시작된다.
//3.종료를 누르게되면 프로그램을 종료시킨다.
//4.비트,연산자를  넣기,빼기를 사용하여서 상태를만든다.
//5.마지막에 출력에 내가 넣은 상태들이 출력되게 만든다.

int main()
{
	while (true)
	{

		//1은 스킬넣기
		//2는 스킬빼기
		//3은 스킬넣은것들 출력하기
		//4는 나가기
	};


	return 0;
}